//电梯运行状态e=1,0，-1（上，停，下）
//电梯所在楼层数f1，人在的楼层f2
//电梯的操作c=11,00,22(上，停，下)
//人的状态p=6,9（想要上行，想要下行）
//判断是否在运行方向上，运行到底（比如往上运行，判断楼上是否还有人/是否有人要去）flag=0,1(无，有)

cin>>p

//当想要上行的情况
if(p==6){
    if(f1>f2){      //电梯在人上方
        switch e:{  //电梯运行状态
            case 1：{//电梯还在往上
                if(flag==1){   //判断此时楼上是否有人/要去，有人则继续向上
                    //电梯向上
                }
                if(flag==0){
                    //电梯向下运行
                }
            }
            case 0:
                //此时电梯向下运行
            case -1:{
                if(flag)
                    //电梯不停，继续下行
                else
                    //电梯停
            }
        }
    }
    if(f1==f2){
        //电梯不运行，等待该人按要去的楼层
    }
    if(f1<f2){
        switch e:{
            case 1:
                if(p==6)
                    //电梯停
            case 0:{
                //停并向上
            }
            case -1:{
                if(flag){
                    //电梯不停
                }
                if(!flag){
                    //电梯停并向上
                }
            }
        }
    }
}

//此时该人想向下
if(p==9){
    if(f1>f2){
        switch e:{
            case 1：{
                if(flag==1){
                   //电梯上行
                }
                if(flag==0){
                   //电梯停并下行
                }
            }
            case 0:
               //电梯下行
            case -1:
               //电梯停并下行
        }
    }
    if(f1==f2){
        //电梯开门，等待该人按要去的楼层
    }
    if(f1<f2){
        switch e:{
            case 1:{
                if(flag){
                    //不停，继续上行
                }
                if(!flag)
                    //停，并下行
            }
            case 0:{
                //开门
            }
            case -1:{
                if(flag){
                    //电梯继续下行
                }
                if(!flag){
                    //电梯停并向上
                }
            }
        }
    }
}
